<template>
  <div class="event-wrapper">
    <svg
      id="vser"
      width="721"
      height="426"
      viewBox="0 0 721 426"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M7.42302 236.368C7.42302 263.538 3.58849 294.134 9.14307 320.897C12.9556 339.266 17.4365 356.901 18.4805 375.693C18.9592 384.308 18.9004 419.027 25.115 422.135M3 247.426C17.8349 261.459 34.926 272.717 49.4416 287.233C63.1616 300.953 70.9874 318.077 78.1911 335.886C83.5283 349.081 87.4604 362.905 93.6717 375.693C95.6699 379.807 98.0947 384.364 98.0947 388.962M71.5565 318.194C56.0293 318.194 43.4726 317.75 30.7665 328.146C23.5315 334.065 14.1405 335.803 7.42285 342.521M51.6531 236.368C65.687 275.352 102.441 304.672 117.875 343.258C121.392 352.05 130.845 362.002 137.902 369.059M91.4602 293.868C117.608 285.329 141.608 283.608 135.199 249.637C131.59 230.509 104.729 226.685 104.729 207.619M133.479 245.214C133.479 269.581 142.056 294.915 151.171 317.703C154.209 325.298 160.835 342.521 171.074 342.521M126.844 198.773C152.869 198.773 187.098 202.649 210.881 189.435C217.373 185.829 222.335 181.988 228.573 178.869M177.709 196.561C178.1 213.372 184.716 228.514 192.084 243.249C198.899 256.88 197.868 273.493 204.738 287.233C210.802 299.36 216.581 309.052 224.15 320.406M228.573 167.812C262.021 191.611 275.691 230.17 298.113 262.784C302.704 269.461 306.501 277.684 312.119 283.301C318.677 289.86 319.245 261.798 319.245 258.238C319.245 250.517 317.605 213.968 325.88 209.83M286.073 145.697C291.748 178.486 308.692 205.445 324.774 234.034C331.121 245.318 354.629 255.911 354.629 269.541M310.399 141.274C351.924 147.206 385.59 187.799 385.59 229.734C385.59 238.168 389.197 243.003 397.753 243.003C405.593 243.003 415.492 245.045 421.466 239.071C437.252 223.285 442.616 215.11 435.103 189.681C430.643 174.586 426.349 158.009 419.868 143.608C417.167 137.605 411.668 131.921 409.917 125.793C407.201 116.288 398.859 111.95 398.859 101.467M396.648 172.235C396.648 189.371 399.914 196.042 407.214 209.83C412.168 219.189 420.974 227.562 420.974 238.58M418.763 81.5632C442.572 106.052 456.478 133.991 472.945 163.266C482.039 179.434 485.927 198.896 496.165 214.253M469.627 68.2942V123.582C469.627 136.519 464.12 146.098 471.962 157.86C479.102 168.571 496.847 175.128 506.117 184.398C513.141 191.422 525.279 195.33 533.761 200.984M505.011 52.8136C504.969 53.0111 504.925 53.2093 504.881 53.4083M504.881 53.4083C502.08 65.8961 494.859 81.3121 498.868 94.3407C503.325 108.827 519.352 119.006 522.58 133.533C524.911 144.022 537.091 154.72 542.607 164.372C548.063 173.919 561.388 177.244 571.356 176.658C579.543 176.176 576.156 145.991 574.059 141.274C567.123 125.666 559.741 109.651 552.559 93.8493C548.11 84.0615 540.094 67.9931 532.655 60.5539C525.299 53.1978 514.409 55.7177 504.881 53.4083ZM504.881 53.4083C504.179 53.2382 503.485 53.0419 502.8 52.8136M551.453 35.1216C561.129 57.0794 569.28 79.6106 578.482 101.467C581.97 109.751 588.56 142.135 595.683 145.697M544.818 30.6986C575.419 49.4762 598.478 76.5798 624.555 100.484C634.231 109.353 640.457 130.398 653.182 134.639M659.817 123.582C659.35 95.1233 644.072 76.5003 634.999 51.0936C631.946 42.5475 625.185 35.7046 622.577 27.0047M622.577 27.0047C622.397 26.4024 622.236 25.7911 622.098 25.1698C620.829 19.4584 616.324 11.9009 613.866 6.37204C608.571 -5.54165 614.796 17.5194 619.027 22.9583C620.136 24.3851 621.324 25.7298 622.577 27.0047ZM622.577 27.0047C638.143 42.8358 663.897 47.8958 677.509 65.5912C684.703 74.9445 694.514 85.2998 702.941 93.7264C707.163 97.9486 710.95 105.89 717.316 105.89M642.125 85.9862C650.181 79.6558 662.184 68.2942 673.086 68.2942"
        stroke="#B8EF73"
        stroke-width="6"
        stroke-linecap="round"
        stroke-linejoin="round"
      />
    </svg>
    <img :src="pic[5]" alt />
    <article class="event-anounce">
      <ul>
        <li>Показ: 29 февраля в 20:00</li>
        <li>Длительность: 90 минут</li>
        <li>Билет: 1000 рублей</li>
        <li>Место: Клуб Blanc</li>
      </ul>

      <p>Дамы и господа, добро пожаловать на Аукцион. Мы приготовили для вас шоу страстей, которое проведет вас по пути алчности и очищения. Мы не торгуем вещами. Материя не интересует нас. Мы специализируемся на душевных переживаниях. На нашем Аукционе вы можете приобрести чужой опыт. То, что никогда не испытывали сами. И то, что останется с вами навсегда. 5 молодых людей — 5 откровенных историй. Воспоминания невинности, болотная эйфория, чувство спасения, привкус греха и отмщения. Все это может стать вашим.</p>
      <p>50 зрителей получают 50 конвертов со случайно распределенной наличностью. Во время Аукциона вы можете докупать наличность, обменивая ее на настоящие деньги в пределах разумного. Выиграв опыт, вы покидаете шоу, и отправляетесь по пути приобретенного переживания. Тем, кому не повезло, оказываются заинтересованными наблюдателями и тоже увлекательно проведут время. В цену билета включен фуршет.</p>

      <p>Участники: Теат ОС + Ася Ашман, Михаил Левин, ВасяРАН, Ромео Кастеллучи, Эрик Клэптон</p>
    </article>
  </div>
</template>

<script>
import picPath0 from "../assets/pic/0.jpg";
import picPath1 from "../assets/pic/1.jpg";
import picPath2 from "../assets/pic/2.jpg";
import picPath3 from "../assets/pic/3.jpg";
import picPath4 from "../assets/pic/4.jpg";
import picPath5 from "../assets/pic/5.jpg";
import picPath6 from "../assets/pic/6.jpg";
import picPath7 from "../assets/pic/7.jpg";
import picPath8 from "../assets/pic/8.jpg";
import picPath9 from "../assets/pic/8.jpg";
import picPath10 from "../assets/pic/10.jpg";
// import picPath11 from "../assets/pic/11.jpg";
// import picPath12 from "../assets/pic/12.jpg";

export default {
  name: "osEvent",
  props: {
    msg: String
  },
  data: function() {
    return {
      pic: [
        picPath0,
        picPath1,
        picPath2,
        picPath3,
        picPath4,
        picPath5,
        picPath6,
        picPath7,
        picPath8,
        picPath9,
        picPath10
      ],
      here: "событие",
      eventText: ""
    };
  },
  computed: {
    slug: function() {
      return this.$route.params.slug;
    }
  },
  created: function() {}
};
</script>
<style lang="scss" scoped>
.event-wrapper {
  background: black;
  font-size: calc(20px + 6 * ((100vw - 320px) / 680));
  font-family: "Hegval";
  display: grid;
  // height: 100vh;
  width: 100vw;
  // background: lightgrey;
  grid-template-columns: 1rem 15vw 3vw 1fr 3em 0.2fr 1rem;
  grid-template-rows: 1rem 8vh 0.3fr 1rem 3vh 0.8fr 0.3fr 0.4fr 0.1fr 1rem;
}
ul {
  font-size: 19px;
}
#vser {
  width: 100vw;
  position: fixed;
  color: lightblue;
  // background: orange;
  // opacity: 0.95;
  mix-blend-mode: difference;
  // border: 1px solid #555;
  text-align: center;
  margin: 1em auto;
  // padding: 2em 0;
  // width: 100%;
  // max-width: 600px;
  // position: relative;
}
img {
  grid-column: 1/-1;
  grid-row: 1/5;
  object-fit: contain;
  // margin-top: 0;
  width: 100%;
  height: 100%;
  // max-height: 40vh;
}
article.event-anounce {
  grid-column: 3/6;
  grid-row: 5/-1;
  margin: 0;
  color: white;
  // font-size: 3rem;
}
</style>
